<?php

namespace Database\Seeders;

use App\Models\Author;
use App\Models\Book;
use App\Models\Category;
use App\Models\Publisher;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class BookSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $book1 = Book::create([
            'category_id' => Category::where('name', 'ريادة الأعمال')->first()->id,
            'publisher_id' => Publisher::where('name', 'أكاديمية حسوب')->first()->id,
            'title' => 'التوظيف عن بعد',
            'description' => 'مع التطور التقني أصبح من اليسير أداء الكثير من الأعمال من أي مكان دون الحاجة إلى الانتقال إلى مكتب معين وتكبد عناء المواصلات أو القيادة، وهذا يوفر النفقات والوقت ويحسن إنتاجية العمل. ولا يشترط أن يكون العمل عن بعد عملًا حرًا أو مستقلًا (فريلانس)، فقد تعمل بنظام الدوام الكامل أو الدوام الجزئي ولكن عن بعد، كما أن وظائف العمل عن بعد لا تشترط بالضرورة أن تعمل من المنزل، بل يمكنك تأجير مكتب في بعض المقاهي أو مساحات العمل المشتركة القريبة منك. تصفح على موقع فرصة',
            'nbr_of_copies' => '300',
            'nbr_of_pages' => '288',
            'price' => '17',
            'isbn' => '1000000001',
            'cover_img' => 'images/covers/1.png'
        ]);

        $book1->authors()->attach(Author::where('name', 'هارون الرشيد')->first());

        $book2 = Book::create([
            'category_id' => Category::where('name', 'التصميم')->first()->id,
            'publisher_id' => Publisher::where('name', 'أكاديمية حسوب')->first()->id,
            'title' => 'مدخل إلى تجربة المستخدم',
            'description' => 'مع التطور التقني أصبح من اليسير أداء الكثير من الأعمال من أي مكان دون الحاجة إلى الانتقال إلى مكتب معين وتكبد عناء المواصلات أو القيادة، وهذا يوفر النفقات والوقت ويحسن إنتاجية العمل. ولا يشترط أن يكون العمل عن بعد عملًا حرًا أو مستقلًا (فريلانس)، فقد تعمل بنظام الدوام الكامل أو الدوام الجزئي ولكن عن بعد، كما أن وظائف العمل عن بعد لا تشترط بالضرورة أن تعمل من المنزل، بل يمكنك تأجير مكتب في بعض المقاهي أو مساحات العمل المشتركة القريبة منك. تصفح على موقع فرصة',
            'nbr_of_copies' => '100',
            'nbr_of_pages' => '1088',
            'price' => '40',
            'isbn' => '1000000002',
            'cover_img' => 'images/covers/2.png'
        ]);

        $book2->authors()->attach(Author::where('name', 'هارون الرشيد')->first());

        $book3 = Book::create([
            'category_id' => Category::where('name', 'العمل الحر')->first()->id,
            'publisher_id' => Publisher::where('name', 'أكاديمية حسوب')->first()->id,
            'title' => 'دليلك المختصر لبيع الخدمات الرقمية',
            'description' => 'مع التطور التقني أصبح من اليسير أداء الكثير من الأعمال من أي مكان دون الحاجة إلى الانتقال إلى مكتب معين وتكبد عناء المواصلات أو القيادة، وهذا يوفر النفقات والوقت ويحسن إنتاجية العمل. ولا يشترط أن يكون العمل عن بعد عملًا حرًا أو مستقلًا (فريلانس)، فقد تعمل بنظام الدوام الكامل أو الدوام الجزئي ولكن عن بعد، كما أن وظائف العمل عن بعد لا تشترط بالضرورة أن تعمل من المنزل، بل يمكنك تأجير مكتب في بعض المقاهي أو مساحات العمل المشتركة القريبة منك. تصفح على موقع فرصة',
            'nbr_of_copies' => '150',
            'nbr_of_pages' => '558',
            'price' => '33',
            'isbn' => '1000000003',
            'cover_img' => 'images/covers/3.png'
        ]);

        $book3->authors()->attach(Author::where('name', 'هارون الرشيد')->first());

        $book4 = Book::create([
            'category_id' => Category::where('name', 'العمل الحر')->first()->id,
            'publisher_id' => Publisher::where('name', 'أكاديمية حسوب')->first()->id,
            'title' => 'الخطوة الأولى للعمل عبر الإنترنيت',
            'description' => 'مع التطور التقني أصبح من اليسير أداء الكثير من الأعمال من أي مكان دون الحاجة إلى الانتقال إلى مكتب معين وتكبد عناء المواصلات أو القيادة، وهذا يوفر النفقات والوقت ويحسن إنتاجية العمل. ولا يشترط أن يكون العمل عن بعد عملًا حرًا أو مستقلًا (فريلانس)، فقد تعمل بنظام الدوام الكامل أو الدوام الجزئي ولكن عن بعد، كما أن وظائف العمل عن بعد لا تشترط بالضرورة أن تعمل من المنزل، بل يمكنك تأجير مكتب في بعض المقاهي أو مساحات العمل المشتركة القريبة منك. تصفح على موقع فرصة',
            'nbr_of_copies' => '500',
            'nbr_of_pages' => '186',
            'price' => '10',
            'isbn' => '1000000004',
            'cover_img' => 'images/covers/4.png'
        ]);

        $book4->authors()->attach(Author::where('name', 'هارون الرشيد')->first());

        $book5 = Book::create([
            'category_id' => Category::where('name', 'ريادة الأعمال')->first()->id,
            'publisher_id' => Publisher::where('name', 'أكاديمية حسوب')->first()->id,
            'title' => 'الدليل المختصر لصفحات الهبوط',
            'description' => 'مع التطور التقني أصبح من اليسير أداء الكثير من الأعمال من أي مكان دون الحاجة إلى الانتقال إلى مكتب معين وتكبد عناء المواصلات أو القيادة، وهذا يوفر النفقات والوقت ويحسن إنتاجية العمل. ولا يشترط أن يكون العمل عن بعد عملًا حرًا أو مستقلًا (فريلانس)، فقد تعمل بنظام الدوام الكامل أو الدوام الجزئي ولكن عن بعد، كما أن وظائف العمل عن بعد لا تشترط بالضرورة أن تعمل من المنزل، بل يمكنك تأجير مكتب في بعض المقاهي أو مساحات العمل المشتركة القريبة منك. تصفح على موقع فرصة',
            'nbr_of_copies' => '200',
            'nbr_of_pages' => '259',
            'price' => '16',
            'isbn' => '1000000005',
            'cover_img' => 'images/covers/5.png'
        ]);

        $book5->authors()->attach(Author::where('name', 'هارون الرشيد')->first());

        $book6 = Book::create([
            'category_id' => Category::where('name', 'ريادة الأعمال')->first()->id,
            'publisher_id' => Publisher::where('name', 'أكاديمية حسوب')->first()->id,
            'title' => 'مدخل للتسويق بالعمولة',
            'description' => 'مع التطور التقني أصبح من اليسير أداء الكثير من الأعمال من أي مكان دون الحاجة إلى الانتقال إلى مكتب معين وتكبد عناء المواصلات أو القيادة، وهذا يوفر النفقات والوقت ويحسن إنتاجية العمل. ولا يشترط أن يكون العمل عن بعد عملًا حرًا أو مستقلًا (فريلانس)، فقد تعمل بنظام الدوام الكامل أو الدوام الجزئي ولكن عن بعد، كما أن وظائف العمل عن بعد لا تشترط بالضرورة أن تعمل من المنزل، بل يمكنك تأجير مكتب في بعض المقاهي أو مساحات العمل المشتركة القريبة منك. تصفح على موقع فرصة',
            'nbr_of_copies' => '180',
            'nbr_of_pages' => '324',
            'price' => '20',
            'isbn' => '1000000006',
            'cover_img' => 'images/covers/6.png'
        ]);

        $book6->authors()->attach(Author::where('name', 'هارون الرشيد')->first());
    }
}
